Revit 2026 API

# CurveUVTransform Method

---

Transform this CurveUV by the given 2D affine transform if possible.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurveUV Transform(
	Transform2D trfUV
)
```
```vb
Public Function Transform (
	trfUV As Transform2D
) As CurveUV
```
```cpp
public:
CurveUV^ Transform(
	Transform2D^ trfUV
)
```
```fsharp
member Transform :
        trfUV : Transform2D -> CurveUV
```

#### Parameters

trfUV Transform2D
     The given 2D affine transform.

#### Return Value

CurveUV If successful a transformed CurveUV, otherwise .

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

CurveUV Class

Autodesk.Revit.DB Namespace